app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visit Narnia"], ["done", 0], ["todo_id", 1], ["created_at", "2023-01-19 22:00:13.332844"], ["updated_at", "2023-01-19 22:00:13.332844"]]
---
  def create
  @todo.items.create!(item_params)

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2023-01-19 22:00:13.466016"], ["id", 1]]
---
  def update
    @item.update(item_params)